Repository: bgeneto/covid-19
Catalog: locale/*/LC_MESSAGES/covid19scraper.po
Languages: pt

source: Checking your internet connection
pt: Verificando sua conexão com a internet

source: Internet connection test failed
pt: O teste de conexão com a Internet falhou

source: Please check your internet connection and try again later
pt: Por favor verifique sua conexão com a Internet e tente novamente mais tarde

source: File '{}' not found
pt: Arquivo '{}' não encontrado

source: Please double-check the 'country_filename' ini setting and try again
pt: Por favor, verifique sua configuração 'country_filename' no arquivo .ini e tente novamente

source: Country translation file not found or corrupted
pt: Arquivo de tradução de país não encontrado ou corrompido

source: Not a valid country name ({})
pt: Não é um nome de país válido ({})

source: Failed getting country codes
pt: Falha na obtenção dos códigos dos países

source: Population data for country '{}' is missing
pt: Os dados da população para o país '{}' estão ausentes

source: Using existing population data file
pt: Utilizando o arquivo de dados de população existente

source: Please wait... web scrapping population data per country
pt: Por favor aguarde... buscando na web a informação sobre população de cada país

source: {} current population: {}
pt: {} população atual: {}

source: Getting population data for country '{}' failed
pt: Falha ao buscar a população do país '{}'

source: Downloading new covid-19 {} csv file from the web
pt: Baixando novo arquivo csv ({})

source: Failed to download csv {} file
pt: Falha ao baixar o arquivo csv ({})

source: Cannot write population file
pt: Não foi possível escrever o arquivo de população

source: Please check your file permissions
pt: Por favor verifique as permissões de arquivo

source: Creating output folders
pt: Criando diretórios de saída

source: Unable to create output folders. Please check filesystem permissions
pt: Não foi possível criar os diretórios de saída. Verifique as permissões do sistema de arquivos

source: Failed to write {} .dat file for day '{}'
pt: Falha ao escrever o arquivo {} .dat para o dia '{}'

source: Failed to write {} .dat file for country '{}'
pt: Falha ao escrever o arquivo {} .dat para o país '{}'

source: Country '{}' not found in csv {} file
pt: País '{}' não localizado no arquivo csv {}

source: numpngw package not available! Please install numpngw and try again
pt: Pacote 'numpngw' não encontrado! Favor instalar o pacote 'numpngw' e tentar novamente

source: Tip
pt: Dica

source: Pillow package not available! Please install Pillow and try again
pt: Pacote 'Pillow' não encontrado! Favor instalar o pacote 'Pillow' e tentar novamente

source: ffmpeg software not available! Please install ffmpeg and try again
pt: Programa 'ffmpeg' não encontrado! Favor instalar o software 'ffmpeg' e tentar novamente

source: Error reading from file '{}'
pt: Erro ao ler o arquivo '{}'

source: Area not found for country '{}'
pt: Área não encontrada para o país '{}'

source: JSON file '{}' not found
pt: Arquivo JSON '{}' não encontrado

source: Using the default language
pt: Utilizando a linguagem padrão

source: cases
pt: casos

source: deaths
pt: mortes

source: Generating .dat files for every selected country
pt: Gerando os arquivos .dat para cada país selecionado

source: number of reported covid-19 deaths per country ({})
pt: número de mortes por covid-19 por país ({})

source: number of reported covid-19 cases per country ({})
pt: número de casos de covid-19 por país ({})

source: number of reported covid-19 cases per million people ({})
pt: número de casos de covid-19 por milhão de habitantes ({})

source: number of reported covid-19 deaths per million people ({})
pt: número de mortes por covid-19 por milhão de habitantes ({})

source: number of reported covid-19 cases per population density ({})
pt: número de casos de covid-19 por densidade demográfica ({})

source: number of reported covid-19 deaths per population density ({})
pt: número de mortes por covid-19 por densidade demográfica ({})

source: total number of confirmed deaths
pt: número total de mortes confirmadas

source: total number of confirmed cases
pt: número total de casos confirmados

source: total number of confirmed cases per million people
pt: número total de casos por milhão de habitantes

source: total number of confirmed deaths per million people
pt: número total de mortes por milhão de habitantes

source: total number of confirmed cases per population density
pt: número total de casos por densidade demográfica

source: total number of confirmed deaths per population density
pt: número total de mortes por densidade demográfica

source: number of confirmed covid-19 {}
pt: número de {} (covid-19)

source: date (m/d/yy)
pt: data (d/m/yy)

source: total number of {}
pt: número total de {}

source: Generating per country historical png figures
pt: Gerando figuras de evolução histórica para cada país

source: Please wait, generating per country bar graph png files
pt: Favor aguardar, gerando arquivos png de gráfico de barras por país

source: This may take a couple of minutes to complete
pt: Isso pode levar alguns minutos

source: Consider running this stage in parallel (-p option)
pt: Considere executar esse estágio em paralelo (opção -p)

source: Please wait, creating bar chart race animations
pt: Favor aguardar, criando animações com os gráficos de barra

source: Consider using -p option next time
pt: Considere usar a opção -p da próxima vez
